[
  {
    "img": "https://m.media-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
    "a-profile-name": "VallyGirl",
    "span": "Got a lemon",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R353HZE03R8YZE/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on September 10, 2023",
    "a-link-normal": "Size: 128GBStyle: Note 20 Ultra 5GColor: Mystic White",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B08HJZDW6M/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "So I just got this today, and so far, I'm not impressed.  Can't tell you how the phone will work yet, as there are absolutely no directions or paperwork included.  As for \"excellent\" condition, yeah, not so much.  I'd judge it as fair to good condition.  There is a great deal of obvious pitting and scratching all around the edges, although not on the screen itself.  It is definitely visible from more than 12 inches away.  I'll be putting it in a case to protect it, so hopefully that won't matter if it's just cosmetic.  I just worry that this phone went through the wringer with it's previous owner. It definitely looks like it's been dropped a few times... I have to say, compared to my current phone, a Galaxy Note 9, also purchased as a refurb over 4 years ago, this one is a disappointment.  That one was pristine when I received it.  Still looks great due to it being in a case, but the battery is starting to go, doesn't hold a charge very long, and gets really hot, really fast.  Also the speaker is going and since I use it for work and do a lot on speakerphone, that's critical for me. I too chose this Galaxy Note 20 as it's the last in the line that has the SD slot. Now I just have to go searching for a user manual online so I can figure out how to transfer all my data and memory/sim/etc.  Once I actually, hopefully, get to use it, I'll come back and update my review. Update: I've had this phone for a couple of months now, and to say I'm underwhelmed is putting it mildly.  Cosmetically, it definitely was NOT in perfect condition.  Very obviously used hard by previous owner.  But I can deal with that.  What I can't deal with is the poor volume control, the fact that it cuts in and out, and locks up.  I find I have to restart it far to often to get it to work.  Not what you want in a phone. I use my phone a lot for work and not being able to rely on clear sound is a deal breaker.  And it's not like I'm walking around and the signal is fading in and out.  I live in an urban area, and talk to others in same area, and half the time I can't hear them or they can't hear me, or the sound cuts in an out.  So very annoying.  It's going back.  I'd better get a full refund or I'm going to be even more ticked.  This one was a rip-off in my opinion.  Completely opposite experience from my first refurb phone.",
    "cr-vote-text": "83 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hMb4GXES7Jd+7A/9L9/gS2P5D4LMfwdVKPfn5cwJAaaAAAAAAGmBvoQAAAAB&reviewId=R353HZE03R8YZE",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "_container": "VallyGirl",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AF5BWGDW6T66RQXJVYVXW3T4Q5NA/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://m.media-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
    "a-profile-name": "Lisawiththevisa",
    "span": "$300 for a \"water resistant\" paperweight and neverending frustrations",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R3HZHC4TY7JM6Z/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on August 1, 2025",
    "a-link-normal": "Size: 128GBStyle: Note 20 Ultra 5GColor: Mystic White",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B08HJZDW6M/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "I got exactly 100 days of use out of the phone this third party seller sent me, and an experience I hope is worth the $300 I wasted on this product. I am a lifelong Samsung product user, so you can imaging the devastation i felt when my Samsung s10e fell into a bath (and stayed in the bath for about a minute).  I purchased the Note20U (as it's the latest Samsung phone with the SD slot) and thought this was the push I needed to get a new phone. And it arrived in decent condition. It was scratchless, turned on with no issue and worked well, and I was quite happy - which would've prompted a 5 star review. However, on the 100th day of owning it, as I washed my hands, droplets of water landed on it. What shouldve been no big deal turned out to be the end of this phone. The phone turned off completely, and is no longer functional. The Note20U has an IP68 rating, the seller advertised it as Water Resistant, and it has no cracks or visible faults anywhere, and somehow the entire camera was full of water. How this happened, I'm not sure but I'm assuming that when the phone was fixed by the seller, they either forgot to or chose not to add the sealing that makes the phone IP68 rating-compatible. I did what anyone else would do - looked at the Amazon A-To-Z Guarantee, contacted the seller and I was told that because the warranty is for 90 days (it was 10 days after the warranty expiration), they couldn't help me with a replacement. The seller offered to reach out to their \"specialists\" to see if I could return it (but I'd have to pay shipping and a restocking fee?!) and when I followed up with whether these \"specialists\" responded, I was told that they would not be receiving it back. Amazon Customer service told me they couldn't do anything about this (all 7 agents throughout a weeks time) So now I have a broken note20u, no refund, no replacement and I'm currently typing this on the cracked, beat up s10e that survived with no water damage. My advice? Don't. And if you do - keep an eye on that warranty.",
    "cr-vote-text": "6 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hAuDQc+6w/ofQ7vvq7eVS7EPAEybEfdaXuC3ZBEHodxaAAAAAGmBvoQAAAAB&reviewId=R3HZHC4TY7JM6Z",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "_container": "Lisawiththevisa",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AF4C7PRNKKUEHHRJTTEBYLVLIKDQ/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "john stephens",
    "span": "They do not quality assure their product",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R3O5230P753ZTU/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on January 22, 2025",
    "a-link-normal": "Size: 128GBStyle: Note 20 Ultra 5GColor: Mystic Black",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B08HL64JS8/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "And I can attest to this because I purchased a refurbished Galaxy Note 20 G Ultra I got this because I love the pen and this is the last of the note series. Now I have never had an issue with a brand new phone or a refurbished phone I've had many. My standard practice is to pull out the screen protector the OtterBox have them set up and ready and then open up the phone install the screen protector install it into the case and then upload all my information to the phone this ensures there's no dust hair fingerprints are Grime on the phone potentially as it is crisp out of the box however after I got into my OtterBox with the screen protector on which cost $50 I turned it on and after a minute I got an alert that my pen wasn't connected I went into the settings try to reconnect it after about a minute and a half of trying to connect it gave me the same error message I uploaded all my data updated the phone wipe the phone updated the phone without my data wipe the phone and my data updated and all the meanwhile I've changed various settings turn all the settings off turn them back on reset and every time I try to connect and then also every time I turn on the phone it tries to connect and it will not link Now there is one of two possibilities either I received a defective pen receiver or the flex cable that attaches the receiver to the phone was not plugged in Now this does not require an in-depth the way you literally boot on the phone and you get an alert with a very annoying Audible ping so you could not have missed this if you quality assured the phone The biggest issue is I return the phone I lose $50 I keep the phone I have to pay full price for a defective phone I talked to Amazon and we came up with a couple offers for the seller try and rectify things and they flat out refuse so I've been f***** over by these people because they didn't quality assure their own product that would have taken 2 minutes and you would have instantly known because you would have been alerted by the phone he didn't have to do anything and just had to be on for 2 minutes",
    "cr-vote-text": "7 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hKFErTME5O3YKjVZOdvUIiG1hjxX81XrWjq/sEIXcFWOAAAAAGmBvoQAAAAB&reviewId=R3O5230P753ZTU",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "_container": "john stephens",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AHR5AKG5LXWQOZFM5YAPNUHCFSNA/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "Chey Blakk",
    "span": "Would Give No Stars If I Could",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R3VYFN5YZKLS7O/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on February 25, 2023",
    "a-link-normal": "Size: 128GBStyle: Note 20 Ultra 5GColor: Mystic White",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B08HJZDW6M/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "Phone came in pristine condition, but then stopped working while still under warranty. I spoke to the seller and they sent me a return label. It was a week or two later that I finally had a chance to mail it off as I do not live anywhere near a dropoff site and of course, they never use USPS for the mailing. I mailed the item off and then received an email that it was received, and I should see my refund soon as they said they couldn't replace the item. No refund showed up, so I contacted them again. They then said that it was sent outside of the warranty period. We literally talked prior to it being out of warranty and I received the mailing label before it went out of warranty which was only a few days before it would've been out of warranty. I could understand if I had waited MONTHS, but it was only a week or two before I was able to send it off. I then asked them to return the product since they refuse to warranty it out. They stated that they need Amazon to send them my address before they can return it to me. This made zero sense as they sent me the product in the first place, so I said okay and spoke to Amazon and told them what the seller said, so they messaged the seller to return the product. I also used Amazon's assistant bot to send the address to the seller, but it shows up as a message coming from me. The seller again then said that this is not what they want, but the Amazon rep told me that they cannot send the seller our address as they do not have access to it. I conveyed this to the seller and told them to just send the product back to the original address it was shipped to in the first place which IS my address. I will see what the reply is and I'll probably being dealing with this issue longer. This was a whole lot of my time wasted on an almost 500.00 phone that worked for a short amount of time. I paid 300.00 to have my Note10 screen repaired, which is what the Note 20 was supposed to replace, and it's been working great, so I'll stick with that. I also bought my husband a Note 20 from the same seller and it is still working, but did the same thing mine did with the screen turning black and not working, but his did eventually come back on in a few hours. I had confidence in these products as they were from the Amazon Renewed store, but never again will I waste my time or money.",
    "cr-vote-text": "17 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hIUuBTzRjBxeR0IEwP2N+PKXi67zkFV4PwP49+EKcWFzAAAAAGmBvoQAAAAB&reviewId=R3VYFN5YZKLS7O",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "_container": "Chey Blakk",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AEFWV3PSNDA45ISTYUZ6AVVY7QFQ/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "Kyle",
    "span": "Samsung Galaxy Note 20 Ultra renewed problem",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R2RAKSCHA1OQ05/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on April 13, 2025",
    "a-link-normal": "Size: 128GBStyle: Note 20 Ultra 5GColor: Mystic Black",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B08HL64JS8/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "I'm writing this as a review of the product and experience, but also as a way to reach out to the seller as Amazon's process keep forcing me to use their chat system. I purchased my Note 20 Ultra 12/6/2024. Initially I was reasonably happy with the phone. It did have issues charging using a cable from the get go and I probably should have exchanged it then, but it charged wirelessly and everything else worked fine. I was just happy to have a functional phone. Today is 4/13/2025 just 5 months from the date of purchase. On 4/11/25 my phone decided that it no longer wanted to connect to cell services. It had entered into a half activated airplane mode that could not be overcome. I tried every fix and workaround listed on all the help boards I could find online. Nothing worked. I took the phone to a repair facility that tried to fix the antenna problem by swapping the daughter board, but it failed as the problem appears to be a deaper issue. I asked them to look into the charging issue, but the problem is deeper and more severe than simply swapping the port. The repair facility also noted that it was an obviously referbished model and that it had not been done well. There were several screws missing internally and the back glass was glued on with an excessive amount of the wrong type of glue. I'm fully aware this phone only comes with a 90 day warranty, but this product is claimed to come professionally inspected to look AND work like new. This does not meet with that claim. I hope to reach some kind of resolution with the seller and be able to adjust this review accordingly, but until then this 1 star review is sadly warranted.",
    "cr-vote-text": "5 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hBtHz9/5lTCEZl/oflSvpoL32E6RzEP2NnRF34z8BrzBAAAAAGmBvoQAAAAB&reviewId=R2RAKSCHA1OQ05",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "_container": "Kyle",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AG5M4VKSEZRAKZET2BD6GMTVVDKQ/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "izz",
    "span": "Terrible refurbishment quality, Terrible refund policy",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R3OZ76LGRZ5T0A/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on March 29, 2024",
    "a-link-normal": "Size: 128GBStyle: Note 20 Ultra 5GColor: Mystic Black",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B08HL64JS8/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "I rarely write bad reviews but this deserves the hoslnest review im writing here. I bought this phone as excellent quality refurbished and holy moly this phone was far from that. When i opened the box it had all it accessories but this thin slightly greasy film on the front and back of the phone, it was all over it and then the plastic film on the front glass of the phone had a bunch of lint and dust on it. I peeled it of and coukd see all the lint and dirt was on the sticky side that adheres to the phone screen. The screen was scratch free and crack free and so was the rest of the phone. But i noticed the color was off and not as vibrant as my s20 fe phone. The galaxy Note 20 Ultra is a top end high quality phone with high quality display. So to see it noticeabley faded and dull looking compared to my S20 it seemed liked something was wrong. Then i tried taking pictures with it and it did not focous well at all. I took it to a cell phone store and compared it to another used Note 20 ultra and they did not have one but the person at the front visually inspected the camera and took pictures with it and he said the camera needed to be replaced. So i just decided to return this phone and get a refund. The return mailing tracking number verified they have had the phone for over a week and still have not refunded me.. I called and was told anything over 100$ it takes about 3 weeks to a month for a refund. So just a heads up if you are interested in this phone and end up returning it. I was not impressed at all with theyre refurbishment quality. This is the second phone ive bought from amazon and have had the same type of experience. I dont think they know how to refurbish cell phones very well and certaintly not to an excellent or even good quality.",
    "cr-vote-text": "23 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hK8F0i8IPyj4f33mCs01B5nd1+uyYnkPbmXKlytPgC2xAAAAAGmBvoQAAAAB&reviewId=R3OZ76LGRZ5T0A",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "_container": "izz",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AGOPDMRIJXNIJGMXZEIKGY2M5M3Q/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "Jorge Renteria",
    "span": "Think twice before buying refurbished items.",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R7A5BL4EO0YO4/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on May 13, 2024",
    "a-link-normal": "Size: 128GBStyle: Note 20 Ultra 5GColor: Mystic Black",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B08HL64JS8/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "Ok I'm gonna be fair with everyone since nobody guaranteed me the phone would last me for a certain amount of time but I also didn't expect a 500 dollar phone to just quit barely one year after i bought it, the phone came in decent condition when I bought it about a year ago, apart from it overheating a little I never had any issue with it and it just suddenly went dark while using it one day, I don't know if this is a manufacturing defect or if it's the refurbished department who didn't do a good job and the fact that it was used I can't really expect the guaranty of a new product so I had to buy another phone after only had it for a year, and I paid $500 for a phone I only got to use for a year because I asked how much was to get it fixed they say it was close to what I paid for it so nah, I'm not blaming anyone over this that's why I never filed a complaint or requested refund or anything I knew it was used and even though it was in decent shape and working condition I didn't expect to last me only for one year so I just wanted to share my experience, hopefully helps anybody from making a mistake. Because if I would've known I was paying 500 for a phone that will only last me a year I would not have bought it or if it would've lasted at least one more year I would still leave a fair review, and like I said I don't blame the seller or amazon for this since I'm sure neither could've predicted this was gonna happen but i still lost 500 for a phone i should still have now. It might not be fair but it's not fair to me either so it is what it is.",
    "cr-vote-text": "5 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hE5olLadUKQnviIz8oNpoIy1vLL6Dez+NuBXpWFy2Ms/AAAAAGmBvoQAAAAB&reviewId=R7A5BL4EO0YO4",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "_container": "Jorge Renteria",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AGDOVGOCI3FLBNO46GGQHWCLRSGA/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "Mike S",
    "span": "Not in \"excellent\" condition as described - TWICE",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R15U30RQHW9QWZ/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on August 4, 2023",
    "a-link-normal": "Size: 128GBStyle: Note 20 Ultra 5GColor: Mystic Black",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B08HL64JS8/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "I purchased this phone that was described to be in excellent condition, which has specific criteria defined by Amazon.  When it arrived, it had protective film over the screen.  Even with the film over it, I could see a large 1\" long scratch on the screen.  Once the film was removed, the scratch was very prominent and could be felt on the screen.  There was also a corner that had been dropped at one point where it was dented and silver due to the anodizing being scraped off. I contacted Amazon right away and they agreed to send out a replacement since it was time critical that I get a phone for my employment.  Hats off to Amazon for their response, but the description by the seller was not accurate at all. UPDATE:  I received my second note 20 ultra from the same vendor, and this time the screen was okay minus a few minor scratches I can live with.  However,  this one has actual pieces of glass inside the bottom camera lens, from what I assume is from a glass repair that wasn't performed properly.  The telephoto function of this particular lense doesn't work properly, which is either a faulty camera or the glass is interfering with the movement of the lense.  When I contacted Amazon, I was not given an option for another replacement, only a return tag and promise of a refund once received.  I had to activate the phone since I could not receive any calls for work and now I'm in a position where I have to pay more money out of my pocket to buy another phone before I can send this one back and get my $400 back. This is beyond frustrating.  I have had good luck with Amazon refurbished before, but I don't know if I'll ever try it again after this experience.",
    "cr-vote-text": "17 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hJgyEt5wlX7yy2QH8i7nP3VshLNDkY1xBjIowPGXBba3AAAAAGmBvoQAAAAB&reviewId=R15U30RQHW9QWZ",
    "a-profile-name_2": "Mike S",
    "cr-lightbox-review-title": "Not in \"excellent\" condition as described - TWICE",
    "a-color-secondary": "Reviewed in the United States on August 4, 2023",
    "a-size-base": "I purchased this phone that was described to be in excellent condition, which has specific criteria defined by Amazon.  When it arrived, it had protective film over the screen.  Even with the film over it, I could see a large 1\" long scratch on the screen.  Once the film was removed, the scratch was very prominent and could be felt on the screen.  There was also a corner that had been dropped at one point where it was dented and silver due to the anodizing being scraped off. I contacted Amazon right away and they agreed to send out a replacement since it was time critical that I get a phone for my employment.  Hats off to Amazon for their response, but the description by the seller was not accurate at all. UPDATE:  I received my second note 20 ultra from the same vendor, and this time the screen was okay minus a few minor scratches I can live with.  However,  this one has actual pieces of glass inside the bottom camera lens, from what I assume is from a glass repair that wasn't performed properly.  The telephoto function of this particular lense doesn't work properly, which is either a faulty camera or the glass is interfering with the movement of the lense.  When I contacted Amazon, I was not given an option for another replacement, only a return tag and promise of a refund once received.  I had to activate the phone since I could not receive any calls for work and now I'm in a position where I have to pay more money out of my pocket to buy another phone before I can send this one back and get my $400 back. This is beyond frustrating.  I have had good luck with Amazon refurbished before, but I don't know if I'll ever try it again after this experience.",
    "a-text-normal": "Images in this review",
    "review-image-tile": "https://m.media-amazon.com/images/I/612EElLmlgL._SY88.jpg",
    "review-image-tile_2": "https://m.media-amazon.com/images/I/61NuYMwVwmL._SY88.jpg",
    "review-image-tile_3": "https://m.media-amazon.com/images/I/61r8jrsUIeL._SY88.jpg",
    "review-image-tile_4": "https://m.media-amazon.com/images/I/71T1ux6W3AL._SY88.jpg",
    "_container": "Mike S",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AGW6UMJACA6BN57SHVXLA4OQFGHA/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "J. Dew",
    "span": "Major inconvenience",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R1Q6STJ5690ZMN/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on October 19, 2022",
    "a-link-normal": "Size: 128GBStyle: Note 20 Ultra 5GColor: Mystic White",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B08HJZDW6M/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "I rarely give 1-star ratings, but the inconvenience associated with this purchase earned it. Received the phone, moved all my data over, input my passwords to all my apps, re-did fingerprint and face recognition, put my credit card info in Samsung wallet, connected different Bluetooth devices, etc.  You all know how tedious that is.  Received a phone call and the person on the other end could hardly hear me.  I thought nothing of it.  Received another call and the person could not hear me.  Decided to test the microphone.  It only picks up static.  Even in a room of silence the playback is pure static.  I have to use an external headset of some sort just to have a phone conversation.  Read online this is a problem with this model.  Even installing the latest software updates didn't fix it. At this point I had already traded in my old phone.  Contacted the seller and was told they wouldn't send a replacement until I mailed the faulty phone.  Was told they would overnight a replacement, but tracking shows it will not arrive the next day.  So, I'll be WITHOUT a phone for 2-3 days.  When I get the phone, I have to take time out of my day to go get it activated, have to take more time to put passwords back into all my apps, take more time to re-register my fingerprints and face ID, take more time to setup Samsung wallet, take more time to re-pair Bluetooth devices, etc. etc.  You get the idea.  It would be easier to accept this outcome if it were merely a used phone sold \"as is\", but this was a refurbished phone.  How did it ever pass inspection with a faulty microphone??  I am waiting for the replacement as I type this.  Fingers crossed there aren't more problems with the replacement whenever it arrives.  If so, I'll be back to type even more...",
    "cr-vote-text": "18 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hBHnn47DDT79qiutt2zXfXoS4mIg7OxZAXh0IJAtBNJEAAAAAGmBvoQAAAAB&reviewId=R1Q6STJ5690ZMN",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "_container": "J. Dew",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AERUHLR2UWYMEIC6E5SQ7MJ25JDA/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "Matt",
    "span": "The last of the Notes is a major failure and I will not ever buy another !",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R2QUQZDHT3GIYA/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on April 9, 2025",
    "a-link-normal": "Size: 128GBStyle: Note 20 Ultra 5GColor: Mystic Black",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B08HL64JS8/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "This has been the worst phone ever ! I had the first one replaced because it would just turn off the screen randomly and not come back on for hours maby a day. Would not register my finger prints at all and would stop every time around 40-50% like it was trolling me. So I sent it back and received what I thought was a almost perfect maby even new one. two weeks later or so Same thing except 10 times worse ! It even one day while I was half asleep started to hiss and got super hot from experience that tells me one thing . \"SHES GONA VENT\" so I ran out side and tossed it on the concrete incase it did. It was so hot you could barely touch it. Now this being not my first NOTE Oh no I have had ever galaxy from the first and every Galaxy NOTE there ever was . This was the last of the notes that Samsung made . I have a sneaking suspicion the problems. I encountered where designed into the phone (\"Not the battery that came from a bad replacement \") . But the screen, the finger print and wacky random shut downs yes . I can not ever in good conscience recommend a NOTE 20 Ultra 5G to anyone ever again! THUMB DOWN !",
    "cr-vote-text": "2 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hENPUsxBQ74vVj/g5KCXiUInvuPFwv4Xw5tgZAuGHNIlAAAAAGmBvoQAAAAB&reviewId=R2QUQZDHT3GIYA",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "_container": "Matt",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AF7OBFBQJ6AMTZ2EP3R3QE6UI3JA/ref=cm_cr_getr_d_gw_btm"
  }
]