[
  {
    "img": "https://m.media-amazon.com/images/S/amazon-avatars-global/475bd5ba-cda6-4a0d-b41c-9613ba4c4c0a._CR0,0,500,500_SX48_.jpeg",
    "a-profile-name": "Anonymous customer",
    "span": "Excellent little powerhouse",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R3FIXS1QESEK36/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on January 13, 2026",
    "a-link-normal": "Color: Titanium SilverblueSize: 256GBStyle: S25 UltraPattern Name: Phone Only",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0DP3CP2SY/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "The Samsung S25 Ultra is an excellent phone from a hardware standpoint. The screen is beautiful, the speakers are loud and clear, and the camera takes great photos. Cell service and internet connectivity have been solid and reliable with no complaints. When I first purchased the phone, the battery life was outstanding—easily close to two full days and comparable to the iPhone 16 Pro Max. Unfortunately, after being forced to install software updates, that battery performance dropped noticeably. What was once amazing is now just decent, with the phone ending a full day around 16% battery, even though I limit charging to 85% to preserve long-term battery health. This feels more like a software optimization issue than a hardware problem, which is disappointing. Bixby and Samsung’s built-in ecosystem are underwhelming to me, but Google’s Assistant AI works very well, and if you don’t like either option, using ChatGPT is a solid alternative. The S Pen is a nice added bonus and genuinely useful at times. The phone itself feels durable, though I still recommend using a case for extra protection. I purchased a new phone and received a new phone and perfect condition. I also haven’t experienced any screen burn-in issues, even with the always-on display enabled. Overall, it’s a powerful and premium device with excellent features, but software updates and battery regression keep it from being a top-tier experience.",
    "cr-vote-text": "5 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hNqkq2/Uiluo16ArDBBX0BjJa5QiaWPZ9cXULd3EWK4WAAAAAGmBkdoAAAAB&reviewId=R3FIXS1QESEK36",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "a-link-normal_3": "",
    "_container": "Anonymous customer",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AH5ZXP6VAGIC54S6YRTSEV3GCNSQ/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://m.media-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
    "a-profile-name": "MBB",
    "span": "Amazing phone with a few things that could be improved",
    "span_link": "https://www.amazon.com/gp/customer-reviews/RJK8RTWNVNPEA/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on November 12, 2025",
    "a-link-normal": "Color: IcyblueSize: 256GBStyle: S25Pattern Name: Phone Only",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0DP3H8WHS/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "The fall prime days deal got me sold over the new iphone 17, as it was 170 bucks cheaper for the same capacity. Coming from an old iphone that has been saying I am tired, everything feels amazing. However, I do have an iphone 15 pro and have used 17 briefly, so I will compare them if you are having to decide between them: Camera: 15 pro has an overall a bit better camera system, pronounced more with indoor shots and low light situations. S25 seems to prioritize faster shutter over better light capture and it can gather less light, limiting its photo quality at low light. At other situations, there is no noticeable quality difference. 17 has a better low light performance as well, but lacks the telephoto lens. The biggest win for S25 camera is the telephoto in my opinion, and it is amazing for professional looking outdoor shots. I may be overusing it during my trips but it has been a game changer for me. pro iphones have the same lens, but they are a lot more pricey. It is a privilege at this price point. The official expert raw app from Samsung gives you a bit more edge over iphones, but it is not enough to compensate for the inferior sensor during point and shoot scenarios. May be a different story if you got time and the skills to use it. Material feel: the aluminum and glass body is iphone like, and it is great to see the phone industry caught up with apple on this. I like the iphone roundness a bit more aestetically pleasing, but my eyes got used to it too. Unlocking: faceID works fine mostly during the day but struggles at night, unlike iphones that can do it at any condition. The fingerprint is my most go to method, but finding where the sensor is sometimes a hit or miss. I drew lines on the case to find it more easily. Also, the accuracy drops a bit further with a glass screen protector and most protectors have the fingerprint accuracy drop as feedback on their pages. I wish I knew this before. Still searching for that amazing screen protector. Screen: 120 hz smoothness has been there for a long time, but my first experience with it now on the android side and 60hz feels yuck at this point. Can't go back. Both 17 and 15 pro has the feature, so no longer a deciding factor, but I am glad to see Apple finally giving that to everyone with 17. Too late for me though. I lost FaceTime and the blue bubbles (or green, I don't remember what color it was), and it has been alright. I am using WhatsApp video calls instead, and I admit that the video quality seems to be noticeably worse, but I got used to it all. The lines are more blurry with imessage, as RCS on the new androids allow for the most of that bubbles privileges. One more loss was airdrop, which I used to use a lot sending photos, but now I just use a usb cable between phones and grab from the iphone using the files manager. I am rooting for a handshake between Google and Apple someday that they will lower the walls. I tried a few third party apps that replace airdrop, but none was ok. On the other hand, finally I can transfer all my photos to my PC at once, by just plugging it! A feature that iphones lack. Tried getting all the photos to backup with the iphone and it fails no matter what I tried. I speculate that they are pushing icloud onto us and japordizing all the other methods for backing up photos, so the exit is here. Just get a phone that doesn't force you to their cloud service (hint: this one). The UI: can be set up like iphone by selecting \"gestures\", but the classic back button layout is more intuitive and the gestures mode seems less polished. A good alternative especially if you swear by the iphone way to interact with your phone. Payment: Apple pay has to strong contenders here: Google Pay and Samsung Pay. Both are very strong but I ended up with Google pay as it is more widely used. From pizza apps to banking, almost all the apps that I used to use Apple pay with just works with Google Pay. Battery life: not noticeably different from 15 pro or 17. 17 has a bit more juice even though it has lower battery capacity, but the difference between this or the others is something I could not tell during my use. The least I can say is that it should not be a deciding factor. Weight and size: feels significantly lighter than the pro Iphones and a bit lighter than the regular. A blindfolded person can easily tell the difference and holding iphones feel heavy to me now. Can't get smaller phones anymore, but hats off to Samsung for sticking with the lightness at least! Overall, a bit better point and shoot camera is not enough to justify that extra for me and I like the flexibility that android gives to this phone. The iphones and this are way too similar than I imagined before getting it, so the switch (both ways) is a lot easier now than ever. I am very happy with the phone and if you are on the fence, I would say just give it a try, please? Update: I found out amfilm screen protector that is made of hard glass and is very thin, so it does not reduce fingerprint accuracy. I totally forgot it was an annoyance. Plus, using the night mode on the camera for any indoor shots give me similar quality shots to the iphone because it tends to increase the shutter time. Turns out the iphone does it without the night mode and it was the secret sauce to better night time pictures. Now I use the Samsung camera more confidently!",
    "cr-vote-text": "54 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hLfaoSM09FMP576kkYbyCwr8QxfvBC8yv2UbkctzNW1kAAAAAGmBkdoAAAAB&reviewId=RJK8RTWNVNPEA",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "a-link-normal_3": "",
    "_container": "MBB",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AHOMGR4KN7CU7TVFQKH7D2243JAQ/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://m.media-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
    "a-profile-name": "Paul M.",
    "span": "Super snappy phone but no SD Card which stinks.",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R66FXRAEH2BP8/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on October 14, 2025",
    "a-link-normal": "Color: Titanium WhitesilverSize: 512GBStyle: S25 UltraPattern Name: Phone Only",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0DP3GBGCF/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "Very snappy phone. I did have some problems initially connecting it to spectrum. It turned out I THINK that the mobile data was turned off in the settings somewhere and I have no idea why. I got it on sale for about 1K and it was normally 1500 as it is the 512GB version. I absolutely hate the fact no major cell phone carriers have sd cards anymore. I want to not have to worry about space for my photos.  I purchased a third party screen protector as I did not want to chance my screen being scratched as well as a battery case which keeps the phone charged over Wireless power delivery so I have full access to the USB port for things like video output. I was coming from a note 10 plus 4g version so this is a big upgrade and I plan to hold on to this phone for another 5 years or so. I upgraded only because certain apps would not support my old android version but the old phone was plenty good. (Oh also my external battery pack died and I couldn't get another one anymore). I do like that they ditched the curved glass as I hated that. They also ditched the backside glass which I hated even more!  Sound Quality is far better than my note 10. It comes out of a slit at the bottom. Initially I did not know what it was. The fit is great as it is almost exactly the same size as my note 10. I would have loved it if they made a more of 8 inch tablet phone but nope. Value for money is so so. I do not like spending 1k for a cell phone especially when it was on sale. It is the same price as a full blown computer but at least on a computer I can put extra storage. I do like the face recognition and the finger print works from behind the glass screen protector. I do wish the S Pen retention was better as I have already lost mine after the phone fell off a shelf. Thank god for the battery case and the screen protector. If they had an SD card I would have purchased a model with less memory. It is just Samsung causing us to pay extra especially since the flash chips are not that expensive and the assembly process is exactly the same.",
    "cr-vote-text": "10 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hFksiDUnysHUs1RVRw1dALb3/3ALmQsJuy171AooJNYeAAAAAGmBkdoAAAAB&reviewId=R66FXRAEH2BP8",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "a-link-normal_3": "",
    "_container": "Paul M.",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AGDVJCSBR7VUUPSEL7HOEB7LVK6A/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "evon",
    "span": "Great phone but horrible operating system",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R24HJPKG19AB24/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on November 15, 2025",
    "a-link-normal": "Color: Titanium WhitesilverSize: 256GBStyle: S25 UltraPattern Name: Phone Only",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0DP3GP92Z/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "I love the phone but they can keep the AI. I upgraded from a very old phone so it was not hard to be impressed with this one. Super fast charging and extremely responsive. The sound and picture quality are mind blowing. The only thing not to like is the ridiculous AI.  The AI is is all about being politically correct. The outcome will be it can not do something or you will get nothing that you asked for. Remember when you did a search and you could actually do research. Well those days are gone. Now the only answer you get is what AI wants you to get, You can put your brain in a safe deposit box as free will and actually thinking are a thing of the past. I get AI when places are actually to cheap to pay for people. They have gone way to far. No longer are you shown how to think. Now it is all about what to think. From all that I have seen/heard the AI was really all that was focused on since last years model (for the most part). Which seems a waste and a shame. It would be a solid 5 stars and possibly one of the best phones ever made if they had a non AI version.",
    "cr-vote-text": "16 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hDNHON6sYA6TC1zCMCQY/PVI9wmXbkxA/ykFXThekmpVAAAAAGmBkdoAAAAB&reviewId=R24HJPKG19AB24",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "a-link-normal_3": "",
    "_container": "evon",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AHNKLYD25LKLZ5GFNGIDNRF32ZKQ/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "Amazon Customer",
    "span": "Very nice but to small for me",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R1SCIFLWKXBJTO/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on December 13, 2025",
    "a-link-normal": "Color: NavySize: 128GBStyle: S25Pattern Name: Phone Only",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0DP3FNTRP/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "I got this because my old phone was over 4 years old and the battery was starting to fail, but I had to send this one back since it was too small for me. As an older guy, texting on it was tough. And kept on loosing it lol  It’s a nice phone, though a bit pricey for its size, and it doesn’t offer much storage. I ended up getting the s 25 FE model for about $225 less, with a bigger screen, more storage, and a larger battery. Almost everything I own for screens are Samsung because they seem to last, though I wish they would provide software updates for a  longer time on there TVs  i think this years mode of phone is a bit of a letdown",
    "cr-vote-text": "One person found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hA4FShYXEk5lqI0+pwKl6SkW8ZJdgiViSm7SZQ3cN1+QAAAAAGmBkdoAAAAB&reviewId=R1SCIFLWKXBJTO",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "a-link-normal_3": "",
    "_container": "Amazon Customer",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AF4IETFCH3FUW3ZJYHLWJAIIZA2Q/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "William L Corbalis",
    "span": "Solid if uninspiring",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R1UU76JC4VU4MX/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on January 7, 2026",
    "a-link-normal": "Color: Silver ShadowSize: 256GBStyle: S25Pattern Name: Phone Only",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0DP3GH34F/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "Eventually did get repaired under warranty so updated to 4 stars. Not sure if you can depend on them. It's a good phone, especially if you're looking for a smaller flagship. Excellent battery life and probably overkill on specs. Which currently seems like a good choice due to threatened DRAM and NAND shortages. Only knock is the convergence of design across most handsets. Outside the foldables it's hard to find a marked difference.",
    "cr-vote-text": "",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hCXQWWvcWY/zZaUdMsURYmX77cqz46m/Wq/1h7xY9ODQAAAAAGmBkdoAAAAB&reviewId=R1UU76JC4VU4MX",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "a-link-normal_3": "",
    "_container": "William L Corbalis",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AGTR2OVFDIL73GQOT6VNCWKTVPSQ/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "BNasTeee",
    "span": "Good phone, no charging block though",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R1EHI82U9MKQ17/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on January 9, 2026",
    "a-link-normal": "Verified Purchase",
    "a-link-normal_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "Good phone, love it, however I'm only giving four stars for the simple reason it doesn't come with a charger block. It's also a new 65w kind of charging block people don't just have laying around the house. To sell a premium device without what you need to use it is crazy. Other than that love the phone.",
    "cr-vote-text": "",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hL3KiSRikPRtMbQa5MY+QU4B4YSv+qE8BSPeyx288dEXAAAAAGmBkdoAAAAB&reviewId=R1EHI82U9MKQ17",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "a-link-normal_3": "",
    "_container": "BNasTeee",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AGAU465M26FW56CQDH2KHDIYOY6A/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "Amazon Customer",
    "span": "Amazingly fast, amazing AI photo fixer feature",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R1H91QOEYYGMS8/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on August 31, 2025",
    "a-link-normal": "Color: Titanium SilverblueSize: 256GBStyle: S25 UltraPattern Name: Phone Only",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0DP3CP2SY/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "Got this as an upgrade for my ancient S9 that's gotten really really slow. Installing and transferring over my apps and data was very easy with the included transfer app. Just make sure to connect both to wifi and let the transfer app update first before trying it. Popped in my old SIM card and it recognized it instantly as expected since this is an unlocked phone. What wasn't expected though was the lack of a microSD slot. Pretty disappointing. Speed is very fast, though the animations are still annoyingly slow. Ended up going into developer options and turning animation speed to 2X and now it just flies and everything is almost instant. As big as it is, I still needed a case for it to protect it, and got one of those plastic inner with silicone cover type cases. Fit very well and made it even bigger and heftier, but such is the cost of wanting to use modern phones. Feels fine though and can still fit into my pocket. Battery life is great. With how fast the phone is I can set it to power save mode and it's still miles ahead of my old S9. And it has a new feature to keep the battery capped at 80%. This prevents the battery from wearing out over time when left on a charger at 100%. You'll have less battery in the short term, but your battery will last years longer before it degrades. The AI photo fixing tools are amazing. Actually went back through a lot of old photos from my S9 that were messed up and didn't have any retakes, and the S25U was able to fix up all of them perfectly. Friend is actually seriously considering switching from iOS because iOS's photos AI is a complete joke.",
    "cr-vote-text": "29 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hL55In+PA8Np6WZ4idPLzHdbOztlbN/O8AwF5CV19SYfAAAAAGmBkdoAAAAB&reviewId=R1H91QOEYYGMS8",
    "a-profile-name_2": "Amazon Customer",
    "cr-lightbox-review-title": "Amazingly fast, amazing AI photo fixer feature",
    "a-color-secondary": "Reviewed in the United States on August 31, 2025",
    "a-size-base": "Got this as an upgrade for my ancient S9 that's gotten really really slow. Installing and transferring over my apps and data was very easy with the included transfer app. Just make sure to connect both to wifi and let the transfer app update first before trying it. Popped in my old SIM card and it recognized it instantly as expected since this is an unlocked phone. What wasn't expected though was the lack of a microSD slot. Pretty disappointing. Speed is very fast, though the animations are still annoyingly slow. Ended up going into developer options and turning animation speed to 2X and now it just flies and everything is almost instant. As big as it is, I still needed a case for it to protect it, and got one of those plastic inner with silicone cover type cases. Fit very well and made it even bigger and heftier, but such is the cost of wanting to use modern phones. Feels fine though and can still fit into my pocket. Battery life is great. With how fast the phone is I can set it to power save mode and it's still miles ahead of my old S9. And it has a new feature to keep the battery capped at 80%. This prevents the battery from wearing out over time when left on a charger at 100%. You'll have less battery in the short term, but your battery will last years longer before it degrades. The AI photo fixing tools are amazing. Actually went back through a lot of old photos from my S9 that were messed up and didn't have any retakes, and the S25U was able to fix up all of them perfectly. Friend is actually seriously considering switching from iOS because iOS's photos AI is a complete joke.",
    "a-text-normal": "Images in this review",
    "review-image-tile": "https://m.media-amazon.com/images/I/517nHVz81dL._SY88.jpg",
    "review-image-tile_2": "https://m.media-amazon.com/images/I/51kuW8NR+DL._SY88.jpg",
    "review-image-tile_3": "https://m.media-amazon.com/images/I/61T4NMOlZ-L._SY88.jpg",
    "review-image-tile_4": "https://m.media-amazon.com/images/I/61xzfyrToFL._SY88.jpg",
    "a-link-normal_3": "",
    "_container": "Amazon Customer",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AHI4R4JWQCHAKJARZ5KJEIBJEFRA/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "Amelia",
    "span": "1 SIM Slot",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R2H0ZKI2BALMTY/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on December 31, 2025",
    "a-link-normal": "Color: IcyblueSize: 128GBStyle: S25 FEPattern Name: Phone Only",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0FG1XRKD9/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "The phone is great depending on your location. My disappointment is the phonw only has 1 SIM slot and no where for a memory card. Still in the process of familiarising myself with the features",
    "cr-vote-text": "",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hPO1PESM1L13R6FJ5KC89REIuG/LAjTrJJuIKxxthzaJAAAAAGmBkdoAAAAB&reviewId=R2H0ZKI2BALMTY",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "a-link-normal_3": "",
    "_container": "Amelia",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AG5AITQL6BLHGEEV4STYHF2BVR2A/ref=cm_cr_getr_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "janet",
    "span": "Mas o menos",
    "span_link": "https://www.amazon.com/gp/customer-reviews/RLNBT0H3NITBQ/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on December 27, 2025",
    "a-link-normal": "Color: IcyblueSize: 128GBStyle: S25 FEPattern Name: Phone Only",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0FG1XRKD9/ref=cm_cr_getr_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "El lector de huellas es un poquito lento y la batería pues no es muy buena. Por lo demás está bien con la AI la camara y tiene varias cosas más en general le doy del 1al 10 un 8",
    "cr-vote-text": "One person found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_getr_d_rvw_hlp?csrfT=hKiQNolH68RGlnxEoyjikzQ5pEeCmcsCpfBgTwXHv8qFAAAAAGmBkdoAAAAB&reviewId=RLNBT0H3NITBQ",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "review-image-tile_2": "",
    "review-image-tile_3": "",
    "review-image-tile_4": "",
    "a-link-normal_3": "Translate review to English",
    "a-link-normal_3_link": "https://www.amazon.com/product-reviews/B0FG1THCD7/#customerReviews",
    "_container": "janet",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AFQCVDL2UJOUGSKSQTP4CSFDCHEA/ref=cm_cr_getr_d_gw_btm"
  }
]