[
  {
    "img": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
    "a-profile-name": "Elle",
    "span": "I love my phone!!!",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R8QSYUTZ8PNSE/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on July 1, 2024",
    "a-link-normal": "Service provider: AT&TColor: LavenderSize: 256GB",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0C7S88BP8/ref=cm_cr_arp_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "My phone arrived undamaged, in perfect condition!  I waited to do this review until I had it for a bit to make sure everything worked right. Well....IT'S AMAZING!!! The phone was not damaged in any way.  It looked like a brand new phone, right out of the box!  Not only that, but it functions flawlessly.  I don't use all of the features (and it has a lot of them), mostly because I don't do social media stuff, or take many pictures.  However, taking pictures is absolutely amazing!  There are sooooo many options: like filters, colors, cropping, picture size, frame size, etc.  There's just a ton of them. There is also Biometric features, which I appreciate.  I had the S9+ and the fingerprint reader was on the back.  If you use the fingerprint feature on this phone, make sure you set a passcode or pin as well.  The fingerprint reader is on the screen.  It shows as a pop-up.  Of course you have to go through the fingerprint set-up first, and can choose more than one finger/thumb.  My concern is that if the screen gets damaged where the reader is, the screen probably wouldn't be able to be able to read your print.  It does NOT have an iris scanner. This IS a 5G phone, but it can connect to 4G and other networks as well. I believe there might have been a SIM card, but I honestly don't remember.  I took the SIM from my other phone and put it in this one, so I didn't need it anyway.  I use AT&T pre-paid, and it works fine.  Right out of the box.  I don't know if it's unlocked to a variety of different network or service providers.  My service provider is AT&T, and the phone I got from this seller is also AT&T.  My recommendation to anyone considering purchasing this phone, would be to contact the seller, first and ask about supported service providers.  If you have AT&T, it's a total win!  :) This phone charges super fast, and the battery life is fabulous.  For my usage, anyway.  You absolutely have to use a fast charging cable, or you'll ruin your phone.  I believe it came with a USB cable, but I can't remember if the block was included.  Either way, if you need to get a charging block, and/or cable, MAKE SURE they're fast charging!!!  I thought the cable it came with was too short for my needs, so I bought a new one on Amazon that is specifically for the S23+...and phones like it. Another recommendation I have is to get an Otterbox.  BEFORE you start using the phone.  If you drop it, then a lot of money was spent for nothing.  The camera lenses on the back protrude.  I personally have the Otterbox Defender series, as the case itself prevents the camera lenses from touching any surface when you lay the phone down.  It's the same if you lay it face down.  The cover prevents the face from touching the surface of anything.  I would seriously consider getting a high quality case with this phone, instead of a cheap knock-off.  (Not all cases are created equal.)  The phone is constructed of metal, not plastic, so it feels very well made.  It's not a light phone, but not super heavy, either.  At least to me. The phone doesn't come in an original box.  At least mine didn't.  It came with the phone and charging cable.  I can't remember if it came with the little key that opens the SIM slot.  If it doesn't, you'll need to get one.  It also doesn't come with a manual.  Also, unless you get the S23 Ultra, there is no stylus.  If that's what you're looking for, the S23+ doesn't have that capability at all.  You aren't able to get an S Pen with it, as the S Pen wouldn't function, even if you bought one and tried. I would also like to mention that it's super easy to transfer your data and contacts (and whatever else) to the S23+.  I don't have any idea about transferring from an Apple product, though.  Samsung is my go-to for phones. As for settings, there are too many to list.  There is a specific one for the battery that I would like to mention, however.  It makes it so your phone doesn't charge over 80% when fully charged, which is important.  The phone won't overcharge that way and end up ruining your battery. As for call settings, there are a lot of those as well.  For people that are hard of hearing, there are options for that.  If, on the other hand, you'd like to protect your hearing and how loud the phone can get while listening to music or talking on it, you can limit the volume.  It has features for the blind, but I don't know what that entails.  It also has the car feature, but I don't know anything about that.  I don't drive. I hope this review was helpful.  :)",
    "cr-vote-text": "56 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_arp_d_rvw_hlp?csrfT=hN6s7LWypOSoj2uU9KoGlvwzqaBp4VkTGjRnzURciJ2kAAAAAGmBtu8AAAAB&reviewId=R8QSYUTZ8PNSE",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "_container": "Elle",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AESXI5WV7WY3MNLB7PXZD23VYPKQ/ref=cm_cr_arp_d_gw_btm"
  },
  {
    "img": "https://m.media-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
    "a-profile-name": "Jon",
    "span": "Great phone, slow shipping",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R1APQVA5I839V5/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on October 26, 2025",
    "a-link-normal": "Service provider: UnlockedColor: Phantom BlackSize: 512GB",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0C4Q7BRXZ/ref=cm_cr_arp_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "Phone came in perfect condition, everything works.  After reading the other reviews, one tip for anyone buying a refurbished phone that's unlocked, an unlocked phone does NOT mean it's an UNLOCKED SIM CARD, in fact,  mine didn't have a SIM card at all, which is fine with me, I had a SIM card already.  But SIM cards are often locked to a specific carrier even if the phone is not. So make sure you have a nano SIM card ready to use, even if it comes with one pre-installed, it may not be for your carrier. I used AI to give me a checklist to make sure all was good.  I suggest you do the same.  I got the \"Excellent\" tier and my phone definitely aligns with that but was way cheaper. Only complaint is that Amazon shipped it like a snail.  This is NOT an issue with the seller,  this is Amazon corporate making decisions on what they feel is most efficient and cost-effective, but when you're ordering a phone, you likely need it fast. And while if I order something dumb like post it notes and cotton candy flavored peanuts, they treat it like a life or death situation like it's a heart transplant and the clock is ticking, for this phone they were like \"You can wait, there's no rush\". But the seller gave me a great deal on a great item, so I can recommend you buy this still,  just be prepared to wait up to a week to get to you",
    "cr-vote-text": "24 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_arp_d_rvw_hlp?csrfT=hMwxEShLmnB7dk8nsivvlDp5xhNF8CKhYerT6NYtnli9AAAAAGmBtu8AAAAB&reviewId=R1APQVA5I839V5",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "_container": "Jon",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AGVNQUL4QDTANFW4DPWQWND24ZAQ/ref=cm_cr_arp_d_gw_btm"
  },
  {
    "img": "https://m.media-amazon.com/images/S/amazon-avatars-global/2d2aae95-5487-44dd-a9f4-fa709e30b976._CR0,0,347,347_SX48_.jpg",
    "a-profile-name": "Tzen lee",
    "span": "Worth the money",
    "span_link": "https://www.amazon.com/gp/customer-reviews/RZZWZ3FG73UTQ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on December 18, 2025",
    "a-link-normal": "Service provider: UnlockedColor: Phantom BlackSize: 256GB",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0C4Q796XC/ref=cm_cr_arp_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "Works great and come with CHARGER! Phone checks out well, fully unlocked and turns on. Battery is good, screen is good with very minor scratch that isn't that noticeable. Speaker is loud and sounds amazing, and camera is definitely way better than my Pixel 6. Very smooth interface and amazing video quality with movies. Would definitely buy again as I just don't see the point in buying the latest and greatest phones. When I could get the latest from a year or 2 ago at a great price! Even though it's refurbished but not too bad.",
    "cr-vote-text": "4 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_arp_d_rvw_hlp?csrfT=hOz3TBEDVYHL8AMcTA2NbZoTkL2+Oj1DRqLP1fpls4zzAAAAAGmBtu8AAAAB&reviewId=RZZWZ3FG73UTQ",
    "a-profile-name_2": "Tzen lee",
    "cr-lightbox-review-title": "Worth the money",
    "a-color-secondary": "Reviewed in the United States on December 18, 2025",
    "a-size-base": "Works great and come with CHARGER! Phone checks out well, fully unlocked and turns on. Battery is good, screen is good with very minor scratch that isn't that noticeable. Speaker is loud and sounds amazing, and camera is definitely way better than my Pixel 6. Very smooth interface and amazing video quality with movies. Would definitely buy again as I just don't see the point in buying the latest and greatest phones. When I could get the latest from a year or 2 ago at a great price! Even though it's refurbished but not too bad.",
    "a-text-normal": "Images in this review",
    "review-image-tile": "https://m.media-amazon.com/images/I/61hSINDIyCL._SY88.jpg",
    "_container": "Tzen lee",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AGJBLY3UKX3P4FPOMRARKHUUWQJA/ref=cm_cr_arp_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "Aijo",
    "span": "Impressed!",
    "span_link": "https://www.amazon.com/gp/customer-reviews/ROWOSN5AQRSE9/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on November 4, 2025",
    "a-link-normal": "Service provider: AT&TColor: LavenderSize: 256GB",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0C7S88BP8/ref=cm_cr_arp_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "The Galaxy S23+ was an impromptu upgrade after I dropped my Galaxy s10e, and it kept disconnecting the carrier sim. This is my first time buying a renewed phone, so I was a bit worried I might end up with a defective phone or one with cosmetic damage, which I can't really stand. 😅 I went for the phone locked to AT&T just in case I ran into any issues. The phone arrived faster than expected. It came in a simple box, and the phone was wrapped in bubble wrap. It came with a usb-c cord for charging and sim tool. I was blown away by the condition of this phone. Phone condition is practically FLAWLESS--only very small, barely noticeable scratches around the charging port. The screen is in stellar condition. Like getting a brand-new phone. The phone was already charged to 67% out of the box. Setup was seamless, and the carrier sim card was recognized without issue. I didn't have to contact AT&T. Wireless data transfer went very smoothly, and I was able to connect to my other Samsung devices (Buds Pro 2, Tablet S8, & s10e). So far, the phone is very responsive. I don't usually pay attention to battery life for any of my Samsung devices, since I usually have chargers or powerbanks on-hand, but the battery life is really good! Lasting all day after intermittent use--from 100% at 8 in the morning to 74% by 5:40 pm. I think I will definitely go this route again in the future. I saved so much money, and it was totally worth the buy.",
    "cr-vote-text": "6 people found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_arp_d_rvw_hlp?csrfT=hB+3JW7h7DQf3+vGnC6dGkzs0vHjVfbcMcKLUloaM3r/AAAAAGmBtu8AAAAB&reviewId=ROWOSN5AQRSE9",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "_container": "Aijo",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AF4CGLWXMZE57GT7LONSFUE2HPVA/ref=cm_cr_arp_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "MomOfTwoAndMore",
    "span": "Twice lucky and good.",
    "span_link": "https://www.amazon.com/gp/customer-reviews/RSR6XBYLIUXGV/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on January 22, 2026",
    "a-link-normal": "Service provider: UnlockedColor: GreenSize: 256GB",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0C7F3ZC53/ref=cm_cr_arp_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "I bought this item twice, both in excellent renewed condition, unlocked to any carrier and green in color. Both phones arrived within their expected delivery window (watch this, they can sometimes be long windows). Both were unlocked and easily added to our vaerizon-based phone plan. Both were in excellent condition with no visible flaws. I'm pleased.",
    "cr-vote-text": "One person found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_arp_d_rvw_hlp?csrfT=hFcsf1oXWiQ3wufrQnM8fWAMxilNkn2rGhbhdvsYu67TAAAAAGmBtu8AAAAB&reviewId=RSR6XBYLIUXGV",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "_container": "MomOfTwoAndMore",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AGTF4X3R2YU2IRO7YGXI43D6SMNA/ref=cm_cr_arp_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "DMAC",
    "span": "Funtionality and performance.",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R9FWC1OQOG6DK/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on January 23, 2026",
    "a-link-normal": "Service provider: UnlockedColor: CreamSize: 256GB",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0C7D91DFZ/ref=cm_cr_arp_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "The phone is in excellent condition. Had no problems transferring everything I needed and it's working well. The only complaint is that there was no reference guide to explain all the perks this thing has. I switched from a S21 ultra and as far as I can tell, it's no different. It would have just been nice to take advantage of the upgrades if this has them.",
    "cr-vote-text": "One person found this helpful",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_arp_d_rvw_hlp?csrfT=hOc0DHvhSV60Yi1oU/kUn4oIefP8xxwnMgW5AeidtQONAAAAAGmBtu8AAAAB&reviewId=R9FWC1OQOG6DK",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "_container": "DMAC",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AGUBEGCTFKYDS7CLB4CGQY4YKJMQ/ref=cm_cr_arp_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "User",
    "span": "Finally Own A Flagship Samsung",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R1IWNL4EXTVI9W/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on December 22, 2025",
    "a-link-normal": "Service provider: UnlockedColor: LavenderSize: 256GB",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0C7F42SKB/ref=cm_cr_arp_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "Bought (Amazon) and recieved (FedEx) the \"Excellent\" refurbished version after debating for a while from the seller Synergy™ two days. I also transfered all my data from the Midrange A54 5G to this refurbished Flagship S23+. Ive gotten the Lavender color with 256 GB internal and 8GB ram and i got to say this Samsung Galaxy S23+ is something else. Not only did the one I recieved look as if its kept in close to mint condition, it also works just fine and is unlocked to use any sim card of choice. There are really small, unnoticeable and minor blemish/scratches but they are hardly there to the point that just looking at the phone makes it seem close to mint if not mint condition! Battery life when I teseted it out in settings says it holds up to 4,000 to 4,700 mAh when not charged when charging and not charged. so for me, it seems like a downgrade when comparing to my 7,050 mAh gaming phone. But thats ok with me. Depending who is/are selling refurbished smart phones and other electronic devices are a hit or miss...and it also depends if you are buying an \"Excellent\" or \"Good\" refurbished goods may differ on what you'll recieve!",
    "cr-vote-text": "",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_arp_d_rvw_hlp?csrfT=hOmzJgjRsZBoo/a1rzSInPqJ4eyOEqFnqZG3zKkAYfuOAAAAAGmBtu8AAAAB&reviewId=R1IWNL4EXTVI9W",
    "a-profile-name_2": "User",
    "cr-lightbox-review-title": "Finally Own A Flagship Samsung",
    "a-color-secondary": "Reviewed in the United States on December 22, 2025",
    "a-size-base": "Bought (Amazon) and recieved (FedEx) the \"Excellent\" refurbished version after debating for a while from the seller Synergy™ two days. I also transfered all my data from the Midrange A54 5G to this refurbished Flagship S23+. Ive gotten the Lavender color with 256 GB internal and 8GB ram and i got to say this Samsung Galaxy S23+ is something else. Not only did the one I recieved look as if its kept in close to mint condition, it also works just fine and is unlocked to use any sim card of choice. There are really small, unnoticeable and minor blemish/scratches but they are hardly there to the point that just looking at the phone makes it seem close to mint if not mint condition! Battery life when I teseted it out in settings says it holds up to 4,000 to 4,700 mAh when not charged when charging and not charged. so for me, it seems like a downgrade when comparing to my 7,050 mAh gaming phone. But thats ok with me. Depending who is/are selling refurbished smart phones and other electronic devices are a hit or miss...and it also depends if you are buying an \"Excellent\" or \"Good\" refurbished goods may differ on what you'll recieve!",
    "a-text-normal": "Images in this review",
    "review-image-tile": "https://m.media-amazon.com/images/I/714+pHVmllL._SY88.jpg",
    "_container": "User",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AHDFHYJF2OQFD3NJVZGRXDOIUQIQ/ref=cm_cr_arp_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "Brooke",
    "span": "Very pleased with phone and transaction!",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R23F17G420MP1N/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on January 22, 2026",
    "a-link-normal": "Service provider: UnlockedColor: LavenderSize: 256GB",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0C7F42SKB/ref=cm_cr_arp_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "Phone came in great condition with a charging cable and plug in. Came earlier than expected. Charged and ready to setup upon arrival. Very pleased",
    "cr-vote-text": "",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_arp_d_rvw_hlp?csrfT=hHV4eLqerTpNTmLboVAbj0FqSIQjwnoRiJzO15ekclSeAAAAAGmBtu8AAAAB&reviewId=R23F17G420MP1N",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "_container": "Brooke",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AHZQYHEFZR22SVDPDUZVPNZZF7DA/ref=cm_cr_arp_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "Tommy",
    "span": "Excellent",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R3OOJJ6BMQ5HSI/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on January 25, 2026",
    "a-link-normal": "Service provider: UnlockedColor: Phantom BlackSize: 256GB",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0C4Q796XC/ref=cm_cr_arp_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "Fast delivery, excellent product, like new (exactly like described), I'm very satisfied.  Thank you. I recommend this seller.",
    "cr-vote-text": "",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_arp_d_rvw_hlp?csrfT=hICR7k2rGH/BkdNOQhiEyhEnlG2tqfrfsJYX+2fVcbpTAAAAAGmBtu8AAAAB&reviewId=R3OOJJ6BMQ5HSI",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "_container": "Tommy",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AG2JJVW6IGMOMXIMPEOKGO4HQ2SA/ref=cm_cr_arp_d_gw_btm"
  },
  {
    "img": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
    "a-profile-name": "Forrest Ay",
    "span": "Good Product",
    "span_link": "https://www.amazon.com/gp/customer-reviews/R2KHHE1ZE5YK9U/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8",
    "review-date": "Reviewed in the United States on January 14, 2026",
    "a-link-normal": "Service provider: UnlockedColor: Phantom BlackSize: 256GB",
    "a-link-normal_link": "https://www.amazon.com/product-reviews/B0C4Q796XC/ref=cm_cr_arp_d_rvw_fmt?formatType=current_format",
    "a-text-bold": "Verified Purchase",
    "a-text-bold_link": "https://www.amazon.com/gp/help/customer/display.html/ref=cm_cr_dp_d_rvw_avp?nodeId=G8UYX7LALQC8V9KA",
    "review-text": "Came just as described. Phone came with a plastic screen protector which is better than nothing. A travel adapter and cable. Product is good. Connectivity, Durability, Battery life and Storage is all good. Thanks",
    "cr-vote-text": "",
    "cr-helpful-text": "Helpful",
    "a-link-normal_2": "Report",
    "a-link-normal_2_link": "https://www.amazon.com/hz/reviews-render/report-review/ref=cm_cr_arp_d_rvw_hlp?csrfT=hKyckXV1JWXfInKejgWB/Aw6mn32iDnm2kN54U5dlunQAAAAAGmBtu8AAAAB&reviewId=R2KHHE1ZE5YK9U",
    "a-profile-name_2": "",
    "cr-lightbox-review-title": "",
    "a-color-secondary": "",
    "a-size-base": "",
    "a-text-normal": "",
    "review-image-tile": "",
    "_container": "Forrest Ay",
    "_container_link": "https://www.amazon.com/gp/profile/amzn1.account.AHGNZYRRUI6XVMGMQW6VJZIYBZXQ/ref=cm_cr_arp_d_gw_btm"
  }
]